Вопросы по первому:
	1) Простые числа p вида p mod 6 = 1 и p mod 4 = 1 не имеют разложения вида d = 2 (mod 3), e = 0 (mod 3) в кольце Z[w]. Но они имеют разложение вида 
	   d = 1 (mod 3), e = 0 (mod 3) (например, 13 = 4^2 + 3^2 - 4 * 3; 37 = 7^2 + 3^2 - 7 * 3 в отличие от 19 = 5^2 + 3^2 - 5 * 3, 31 = 5^2 + 6^2 - 5 * 6).
	   Числа p вида p mod 6 = 1 и p mod 4 = 3 имеют разложение вида, требуемое в задании
	2) Не до конца понял условие (3.17), можно ли использовать аналогичное условие 4. из 5?

Вопросы по третьему:
	1) Два режима работы: алгоритм формирования цифровой подписи, алгоритм проверки цифровой подписи? (Из книги: в качестве альтернативного протокола
	   подтверждения подлинности предлагается использовать протокол Шнорра; алгоритм формирования ЦП -- согласно ГОСТ Р 34.10-2001) Показать, что нашёл

Вопросы по четвёртому:
	1) Видимо, совершенно иной процесс генерации кривой

Вопросы по пятому:
	1) Таблица сложения элементов становится громоздкой. Алгебраическая структура группы -- имеется в виду, является ли произведением циклических 
	   подгрупп или всякий элемент является образующим? 


I вариант.
1) Алгоритм генерации ЭК с j = 0: 1. стр. 144, 5. стр. 307
2) Адаптация протокола Диффи-Хеллмана: 5. стр. 321
3) Адаптация протокола цифровой подписи Шнорра на эллиптических кривых: 5. стр. 325
4) Аналог генератора псевдослучайной последовательности Блюма-Блюма-Шуба: 5. стр. 330
5) ?

II вариант.
1) Алгоритм генерации ЭК с j = 1728: 1. стр. 145, 5. стр. 309
2) Цифровой подписи Эль-Гамаля на ЭК: 5. стр. 323
3) Неинтерактивный протокол аутентификации: 5. стр. 327
4) Протокол создания электронной монеты на основе протокола Эль-Гамаля на ЭК: 5. стр. 331
5) ?
